'''3. Створити функцію як отримує рядок та визначає чи є він Паліндромом.
	Врахувати, що символи розділових знаків і розмітки тексту не враховуються при пошуку паліндрому,
	враховуються лише літери та цифри.
	Також враховувати що літери можуть бути великими і малими, але однаковими за значенням.
		Наприклад:
			І що сало? Ласощі
		Після обробки в функції повинно повернути що це
			Паліндром

	*Ручний вибір символів не приймається!'''


my_str = 'І що сало? Ласощі'
my_str_2 = 'Кит на морі романтик.'
my_str_3 = 'Першим автором паліндромних віршів на Заході вважається Сотад.'

def format_list(row:str):
    '''Функція приймає рядок і визначає чи є він палідромом.'''

    row = row.replace(' ', '')
    temp_list = [el.lower() for el in row if el.isalnum()]
    format_row = ''.join(temp_list)
    rezult = ['Паліндром' if format_row == format_row[::-1] else 'Не паліндром']
    return rezult[0]

print(my_str)
print(format_list(my_str), '\n')
print(my_str_2)
print(format_list(my_str_2), '\n')
print(my_str_3)
print(format_list(my_str_3))

