'''1. Створіть функцію, яка приймає список, та індекс
	початку сортування та індекс кінця сортування,
	і повертає список у якому відсортовані лише ті елементи,
	які укладені між індексом початку сортування та індексом
	кінця сортування.
		Наприклад:
			[1,10,9,4,5,7,2,0], 2, 6
		Відповідь
			[1,10,4,5,7,9,2,0]

	У відповіді повернути ПОЧАТОКОВИЙ список але з
	відсортованою частиною!'''

my_list = [1, 10, 9, 4, 5, 7, 2, 0]

def sort_list(some_list:list, start_index:int = None, end_index:int = None, reverse=False):
    '''Функція sort_list() приймає список та індекси зрізу для сортування і повертає
    відсортований оригінал списку'''

    some_list[start_index:end_index] = sorted(some_list[start_index:end_index], reverse=reverse)
    return some_list

sort_list(my_list, 2, 6, True)

print(my_list)