'''1. Сворити список мінімум з 10и елементів(тип данних для простоти int або float)
	a. Виведіть усі елементи списку з парними індексами.
	b. Знайти суму елементів всього списку.
	c. Знайти суму парних елементів списку та окремо непарних елементів списку.
	d. Виведіть значення найбільшого елемента у списку, а потім індекс цього елемента у списку.
		Якщо найбільших елементів кілька, виведіть індекс першого з них.'''

my_list = [2, 88, 1, 5, 8, 11, 78, 6, 7, 88, 12, 13, 88]

cup_index_el_list = my_list[::2]
x = my_list[::2]
sum_list_el = sum(my_list)
sum_cup_el = sum([el for el in my_list if el % 2 == 0])
sum_nocup_el = sum([el for el in my_list if el % 2 != 0])
max_elem = max(my_list)
index_max_el = my_list.index(max(my_list))

print(f'''a. Усі елементи списку з парними індексами: {cup_index_el_list}
b. Сума елементів всього списку: {sum_list_el}
c. Сума парних елементів списку: {sum_cup_el} та сума непарних елементів списку: {sum_nocup_el}
d. Значення найбільшого елемента у списку: {max_elem} та індекс цього елемента у списку: {index_max_el}''')
