'''3. Створити список (наприклад, розміром 20 елементів) і заповнити елементами
    (для протсоти можна int або float).
	Сортувати список по 5 елементів.
	Тобто:
		перші 5 елементів відсортувати за зростанням,
		другу п'ятірку елементів за спаданням
		третю п'ятірку відсортувати за зростанням
		і четверту п'ятірку за спаданням.
	Наприклад:
		на початку [32,43,1,3,4,5,34,5,1,7,10,34,17,11]
		на виході [1,3,4,32,43,34,5,7,5,1,10,11,17,34]

	Відповідь необхідно повернути в одному списку!
	*наприклад - мається на увазі, що це зразковий варіант розміру списку,
	а вам необхідно написати алгоритм, який зможе відсортувати список будь-якого розміру.'''

my_list = [32, 43, 1, 3, 4, 5, 34, 5, 1, 7, 10, 34, 17, 11, 45, 1, 2, 3, 4, 5, 23, 22]

if len(my_list) <= 5:
    print(sorted(my_list))
else:
    start_range, end_range = 0, 5
    while start_range < len(my_list):
        my_list[start_range:end_range] = sorted(my_list[start_range:end_range], reverse = start_range % 2)
        start_range += 5
        end_range += 5
    print(my_list)
