'''1.Створити три рядки.
	Створити алгоритм виведення на екран середини(мається на увазі символ або
	символи які стоять в середині рядка) кожного із трьох рядків введених з клавіатури.'''

string_list = [str(input('Введіть перший рядок: ')),
               str(input('Введіть другий рядок: ')),
               str(input('Введіть третій рядок: '))]

for i in string_list:
    mid_el_index = len(i) // 2
    if len(i) % 2 != 0:
        print(i[mid_el_index])
    else:
        print(i[mid_el_index-1:mid_el_index+1])
